# GetTextureSet

## Description
Gets the texture set of an object.

```pascal
FUNCTION GetTextureSet(object : HANDLE) : INTEGER;
```

```python

def vs.GetTextureSet(object):
    return INTEGER
```

## Parameters
|Name|Type|Description|
|---|---|---|
|object|HANDLE|The object.|

## Returns
The texture set.<BR>
<BR>
0 - Object textures<BR>
1 - Component textures

## See Also
VS Functions:
SetTextureSet

## Version
Availability: from Vectorworks 2011
## Category
* Textures